{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "GroundingDINO",
    "parent_library": "models.GroundingDINO.groundingdino"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "values_v_proj",
    "out_l_proj",
    "linear1",
    "values_l_proj",
    "v_proj",
    "query",
    "output_proj",
    "key",
    "value",
    "out_v_proj",
    "value_proj",
    "l_proj",
    "linear2",
    "attention_weights",
    "sampling_offsets",
    "dense"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}